Autodesk.Revit.DB.AngularDimension.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},Autodesk.Revit.DB.DimensionType)
Creates a new instance of an Angular Dimension element within the project.
document:
The document where new Angular Dimension is created.
dbView:
The view in which the Angular Dimension will appear.
arc:
Arc for the Angular Dimension.
references:
The references which the Angular Dimension will witness.
dimensionStyle:
Dimension Style.
Returns:
The newly created Angular Dimension instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
References should be: at least two, non parallel and rays of the arc passed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017